import socket


ip_target = '127.0.0.1'
port_target = 9997


client = socket.socket(socket.AF_INET, socket.SOCK_DGRAM)

client.sendto(b'AAABBBCCC', (ip_target, port_target))

data, addr = client.recvfrom(4096)

print(data.decode())
client.close()



"""
برای استفاده از UDP در پایتون، نوع سوکت را به SOCK_DGRAM تغییر می‌دهیم. این سوکت برای پروتکل UDP طراحی شده که به صورت بدون اتصال کار می‌کند.
برخلاف TCP که اتصال برقرار می‌کند، در UDP نیازی به فراخوانی connect() نیست و بسته‌ها را مستقیماً ارسال می‌کنید.

بعد از ایجاد سوکت، از متد sendto() برای ارسال داده‌ها استفاده می‌کنید.
این متد داده‌ها را به بایت تبدیل کرده و به آدرس سرور (IP و پورت) ارسال می‌کند.
چون UDP پروتکلی بدون اتصال است، نیازی به برقراری ارتباط ندارید.

برای دریافت پاسخ از سرور، از متد recvfrom() استفاده می‌کنید.
این متد داده‌ها و جزئیات سرور (IP و پورت) را برمی‌گرداند. این ویژگی به شما کمک می‌کند که متوجه شوید پاسخ از کجا آمده است.

هدف از این توضیحات، انجام کارهای سریع و آسان در آزمایش‌های شبکه است. UDP برای انجام آزمایشات سریع و ساده مناسب است.



    UDP پروتکلی بدون اتصال است و نیازی به برقراری ارتباط و تایید داده‌ها ندارد.
    SOCK_DGRAM برای ساخت سوکت‌های UDP استفاده می‌شود.
    sendto() برای ارسال داده‌ها و recvfrom() برای دریافت پاسخ‌ها به کار می‌رود.
    هدف، انجام کارهای سریع و ساده در آزمایش‌های شبکه‌ای است.
"""